the
of
return
a
and
is
in
to
an
that
are
given
if
array
integer
number
you
where
with
be
each
it
all
can
for
n
1
from
two
or
any
one
0
at
by
there
not
string
as
such
integers
order
have
example
on
length
following
nums
-
i
same
x
no
has
will
this
only
may
0-indexed
minimum
note
maximum
2
value
after
answer
ith
k
sum
find
than
equal
some
possible
which
s
its
elements
between
then
must
first
should
binary
every
true
also
otherwise
positive
characters
more
into
left
so
strings
represents
values
we
-1
3
right
exactly
list
other
false
make
element
m
time
nodes
them
tree
times
index
both
numbers
2d
contains
ie
most
size
row
least
empty
int
your
j
valid
different
they
node
representing
sequence
their
multiple
when
exists
words
character
choose
letters
b
either
result
count
column
unique
operation
matrix
7
root
arrays
does
once
sorted
represented
another
smallest
move
distinct
query
do
operations
adjacent
total
indices
non-empty
consisting
want
consists
digits
type
three
using
cannot
key
grid
returns
range
class
write
position
without
format
within
large
initially
implement
numsi
since
largest
indicates
name
starting
contiguous
109
less
modulo
path
but
last
4
new
these
arr
ii
5
considered
defined
contain
next
set
containing
lowercase
table
need
remove
greater
object
c
start
target
before
initializes
cell
end
inclusive
pair
substring
denotes
form
even
generated
single
above
second
get
difference
subarray
remaining
original
guaranteed
word
letter
function
y
take
up
primary
consecutive
sql
schema
numbered
until
means
called
longest
english
edges
input
allowed
respectively
test
add
pairs
game
edge
use
reach
strictly
rules
cells
conditions
digit
connected
non-negative
change
moves
current
product
score
id
subsequence
assume
always
point
cases
zero
four
labeled
however
group
leading
points
check
starts
perform
while
distance
follows
deleting
needed
was
amount
steps
void
exist
space
could
step
numsj
day
formed
replace
appear
6
because
case
answers
positions
top
ai
t
down
very
many
used
whose
ways
square
possibly
increasing
queries
1s
9
would
way
formally
who
10
graph
bi
substrings
represent
num
changing
rows
data
zeros
answeri
returned
nums1
notice
ascending
jth
varchar
becomes
ends
0s
resulting
delete
person
below
pick
design
search
algorithm
xi
absolute
present
linked
through
d
takes
odd
edgesi
part
structure
smaller
subarrays
output
determine
head
appears
required
undirected
swap
lexicographically
previous
final
common
line
cost
itself
impossible
numslength
task
solution
corresponding
place
turn
removing
r
null
like
split
children
been
nums2
about
good
complete
non-decreasing
8
val
direction
moving
including
how
shortest
directly
still
separated
equals
representation
performing
yi
whether
price
among
call
made
arri
permutation
let
according
convert
consider
height
process
chosen
alice
maximize
initial
palindrome
sort
types
information
report
removed
kth
go
none
too
out
accepted
32-bit
apply
divisible
people
prefix
reverse
average
decimal
bottom
ordered
spaces
except
problem
along
z
groups
optimally
become
----------------------
alphabet
obtained
over
1-indexed
satisfies
highest
color
level
placed
ones
city
already
divide
keys
subsequences
applying
coordinates
paths
infinite
occurrence
being
boolean
insert
goal
child
actual
leaf
uppercase
define
code
lower
duplicate
occurs
shown
p
obtain
minimize
lengths
bob
wants
play
bitwise
construct
duplicates
negative
board
long
plane
area
traversal
entire
special
concatenation
simultaneously
water
playing
turns
solve
abc
pass
during
ab
occurrences
written
days
date
columns
travel
parentheses
trees
parent
those
were
queriesi
player
si
l
minutes
currently
repeat
system
subset
never
derived
iii
forward
players
together
outside
added
complexity
beginning
xor
interval
visit
connecting
know
frequency
100
side
relative
subtree
extra
squares
calculate
unit
fit
closest
seconds
calls
create
money
back
bits
corner
ans
visited
lists
rearrange
built-in
build
partition
customer
stones
greatest
10-5
employee
tie
e
instead
o
select
functions
described
u
user
lowest
constraints
receive
divided
arranged
correct
choosing
twice
bottom-right
needs
based
see
adding
necessarily
put
rectangle
said
flip
satisfy
text
s1
s2
he
prices
again
stone
just
changed
bst
assigned
vertical
top-left
directions
taken
results
inside
east
concatenated
third
denoting
consist
width
per
standing
buy
achieve
map
rotate
divisor
larger
adds
denote
found
describes
full
replacing
passed
addition
expression
nth
invalid
item
11
upper
front
random
names
bit
circular
vi
meaning
leftmost
please
fewer
students
max
coordinate
location
followed
repeated
road
under
located
ids
ansi
stop
n-1
mat
longer
endi
starti
------------------------
calculated
dictionary
v
vertically
trailing
division
land
backward
mentioned
state
1st
nums0
method
employees
merge
append
student
filled
sums
prime
available
continue
several
exceed
include
certain
colors
power
horizontal
assign
done
signed
occur
ui
arrlength
rounded
removes
destination
clockwise
reads
weight
costs
diagonal
west
units
gets
4-directionally
col
follow
keep
store
similarly
maximized
pointsi
condition
run
immediately
best
sequences
middle
match
minimized
limit
places
increment
wordsi
subtract
arrj
customers
horizontally
going
rotation
modify
properties
fn
scores
123
might
rest
north
south
building
nums1i
repeating
minute
deleted
sentence
ending
intervals
floor
box
transform
rearranging
non-overlapping
x-axis
round
finish
pattern
wall
numsk
palindromic
items
arr1
inserts
concatenating
events
h
zeroes
well
stops
suppose
runs
differ
win
alternating
wins
fits
jump
making
specific
ri
-----------------------
his
reaches
increase
seats
continuous
vertices
depth
replaced
walk
flips
sign
directed
nearest
version
assuming
encoded
counted
foreign
12
users
iv
network
solutions
event
suffix
file
pay
sell
base
plus
belong
2nd
3rd
salary
permutations
leaves
robot
around
inserted
moment
cities
print
inputs
examples
friend
friends
o1
room
begin
belongs
additional
having
similar
higher
rightmost
break
constructed
x1
arr0
swaps
rule
neighbors
queue
2n
cover
f
stack
included
subsets
earliest
transactions
stock
degrees
subtrees
constant
rooted
white
created
products
winner
changes
ordering
asked
randomly
intersection
shows
modified
25
leave
denoted
instance
program
-------------------
additionally
now
rectangular
onto
off
applied
orders
company
hold
share
seat
meets
accepts
red
blue
speed
supports
rotated
specifically
probability
played
placing
performed
remains
pointer
singly
circle
etc
wait
bool
hour
open
pricesi
profit
evaluate
mark
image
uses
combination
word2
word1
our
collect
center
-x
dollars
holds
covered
lefti
pile
boxes
much
double
maximal
26
due
matching
decide
latest
had
sorting
arithmetic
x-y
stream
non-zero
period
1000
matches
x2
colored
high
lexicographical
beautiful
pricei
identical
cycles
car
13
bidirectional
w
num2
num1
userid
what
distribute
nothing
queriesj
island
tasked
nested
brackets
90
read
swapping
say
heights
decreasing
taking
stay
completely
timei
satisfied
0th
piles
associated
candies
righti
decided
parallel
series
numsi1
segment
manager
piece
she
capacity
update
15
decrease
top-right
counts
sets
tasks
anywhere
frequent
later
arbitrary
traveling
remain
makes
course
gridij
low
language
triplets
a2
generate
meet
five
coins
started
year
balanced
house
reversed
requirements
reorder
operator
rank
insertion
support
rounds
work
implementation
arrive
come
21
help
surrounded
in-place
weights
combinations
chessboard
vice
versa
replacement
obstacle
axis-aligned
request
toi
fromi
nums2i
factors
source
roads
ranges
parts
andor
c1
free
exam
card
01
reconstruct
rectangles
bottom-left
block
overlapping
finally
running
divides
vertex
multiplication
hours
overlap
sides
received
finding
preorder
expressions
bank
recall
vowels
cycle
pieces
y1
answerlength
rotating
231
slength
abcde
equivalent
labels
stored
push
mapping
cut
segments
houses
manner
concatenate
a1
radius
reachable
indicating
enum
comes
decode
rearranged
perfect
subsequent
message
multiply
fixed
forming
non-increasing
increases
closed
age
30
content
lead
transaction
real
memory
alices
stonesi
missing
black
removals
removal
4th
excluding
grouped
reduce
separate
boundary
garden
thus
deletions
requests
far
ancestor
leetcode
country
enter
themselves
contained
able
modifying
converted
kind
doing
broken
us
sold
costi
intervalsi
inserting
cards
picked
20
explanation
formatted
regardless
fully
others
splitting
ignored
copy
balls
321
earlier
mean
triangle
particular
chooses
previously
serialization
olog
forms
satisfying
draw
divisors
street
team
increments
g
own
checks
logs
differences
notes
pop
deletion
nums2j
absx
factor
provided
evaluates
strs
courses
indicate
give
half
querieslength
repeatedly
vowel
arrarrlength
anagram
significant
analysis
productid
cardinal
judge
hand
amongst
indexed
figure
descendant
record
flipping
shape
world
did
intersect
label
happens
descending
across
connection
server
shop
log
field
valuesi
variable
parents
simple
independent
abcd
earn
palindromes
collection
towards
online
trying
numeric
diagonally
centered
obstacles
wikipedia
calling
limited
subtraction
public
nor
jumps
built
selected
candy
ci
operators
underlined
visits
23
hhmm
1th
custom
whole
here
hi
job
ball
addint
lets
eat
counting
equally
movement
alternate
runtime
traverse
loses
lose
answer0
answer1
bag
workers
worker
sentences
exact
ensure
sequentially
optimal
nodeval
passes
cols
reached
met
endpoints
puzzle
r1
toward
stores
definition
absi
y2
descendants
composed
encoding
finished
testcases
affect
trip
rating
objects
arr2
happy
reports
opposite
completed
tasksi
drop
pushes
evenly
sit
executed
doesnt
choice
reference
small
-3
allow
waiting
minimal
lines
li
22
timestamp
milliseconds
101
methods
future
partitioning
weighted
disjoint
phone
symbol
generates
unless
food
lie
threshold
named
servers
indirectly
unable
attend
valuei
instructions
determined
equation
islands
question
allocate
132
transformation
fourth
persons
marked
employeeid
enough
perimeter
walking
facing
frequencies
buildings
leaving
border
partitions
connects
secret
fill
threads
neither
continues
idi
tokens
c2
away
gain
various
neighboring
partitioned
website
social
printed
aa
her
multiplied
plant
0000
00
60
-------------------------
arguments
else
wi
median
diagonals
anagrams
painted
wrong
compute
interpreted
sitting
reset
moved
returning
shift
permi
perm
access
corresponds
104
procedure
teams
evaluation
goes
merged
department
pushint
straight
computed
necessary
answerj
works
quantity
50
constructor
individually
nice
distances
unknown
ace
roots
falls
fall
1234
q
tile
shorter
station
coin
locations
positioned
appended
address
chunk
parenthesis
linear
arrival
mod
arrk
triplet
cars
compare
treat
differs
shapes
existing
criteria
positioni
writing
error
outgoing
allows
arrives
occupied
arrange
walls
pivot
automatically
pairsi
huge
16
property
weighti
rooms
video
connections
erasing
s3
configuration
him
engage
evaluating
lands
disturbing
sizes
attack
roll
dice
die
rolls
super
010
xth
sliding
beauty
candidates
stand
expected
school
further
magic
sj
apple
planted
formula
produce
bi-directional
supply
calculation
thread
frog
games
token
gives
selling
typed
keyboard
yj
05
media
send
percentage
sale
strength
partial
flowers
24-hour
parameter
happen
slices
detect
y-axis
email
emails
matter
paint
green
nesting
symbols
pilesi
crossing
cross
likely
solutionint
pi
internal
gcd
blocks
shifting
idle
face
alphabetically
unlock
security
office
coming
spend
infinitely
restaurant
logsi
daily
outer
--
opening
chose
duration
beyond
filling
robots
decoded
resultant
updates
diff
container
periods
simplified
causes
calculator
fibonacci
-231
schedule
kinds
iterator
sub
ladder
prerequisites
simplicity
reformat
alphanumeric
customerid
zigzag
cant
accounts
arrangement
k-th
tiles
varying
sub-arrays
sales
inclusively
i1th
roadsi
numsn
mountain
specified
provide
unfortunately
lost
booking
shares
instances
converting
execute
languages
train
phrase
overall
dot
visiting
quality
maps
components
meeting
19
blocked
activity
rowi
bags
handle
nums1length
sent
local
alphabetical
conversion
guess
window
root-to-leaf
describe
14
ranks
delay
diagram
repeats
preceding
regular
competition
topmost
reaching
includes
entries
fair
downward
calendar
month
forever
vj
uj
hello
balance
recursively
rearrangement
messages
tests
cause
api
applies
40
slots
respective
bus
passengers
falling
standard
consecutively
heighti
endpoint
neighbor
collected
computer
trips
x-coordinate
freely
levels
2s
cuts
mapped
complement
proven
chunks
intermediate
library
counterclockwise
libraries
hash
critical
connectionsi
non
eventsi
whereas
pref
filetxt
sn
t1
t2
lucky
factorial
cj
marks
bracket
wide
bobs
135
close
unsorted
queens
bc
numsnumslength
0100
separating
representations
recent
root1
root2
startpos
trivially
appending
view
-2
command
euclidean
origin
ever
xy-plane
net
component
parenti
averages
therefore
ugly
passing
journey
summation
knows
belonging
fraction
bar
jumping
river
avoid
restrictions
tallest
buying
discount
validate
xj
constraint
travels
resulti
rain
receives
themself
actually
i1
teacher
i0
27
title
i-th
direct
counter
getint
leetcodecom
searchword
2359
everyone
instantaneously
indexi
undefined
shuffled
clear
details
working
treated
script
statement
keeping
234
calculates
painting
0-9
solving
eats
eating
splits
shuffle
minus
interface
vali
bitwise-xor
serialized
attributes
refer
besides
two-dimensional
signifies
matrixs
main
wrapping
shifts
generator
inorder
yields
recursive
occurring
remember
indexing
dots
submatrices
numsl
arrows
keeps
balloon
balloons
011
section
decrement
ability
entering
folder
terms
records
basket
baskets
gridrc
floors
picks
colorsi
aj
jobs
composition
postorder
paper
p1
lodashs
recover
session
mathematical
f1
grow
yellow
counter-clockwise
rotations
compressed
continuously
indicesi
valsi
initialized
hasnext
min
dist
route
ki
track
anything
account
deletes
appends
r2
status
possibilities
usual
dashes
furthermore
stations
unlimited
denominations
productname
questions
market
acyclic
relationship
peak
hamming
nary-tree
n-ary
assigning
vice-versa
banned
routes
non-space
causing
self
crosses
allocated
tickets
json
jsonparse
b2
flatten
pointers
float
infected
whenever
numerical
acb
hidden
boundaries
resolve
execution
capital
compared
001
ignoring
xs
integral
tower
bad
considering
desired
a0
repetition
login
seven
pathsi
coli
turned
key-value
clock
dropped
try
unoccupied
restricted
domain
collide
nums3
endtimei
starttimei
endtime
starttime
seq
insertint
finds
orderdate
n2
actions
domino
distribution
labelled
dates
tournament
participating
numsright
numsleft
picking
sk
machine
happened
via
skip
ended
known
triple
my
successful
500
simply
nine
passenger
connect
star
display
eight
nums2length
rectanglesi
ratio
immediate
decreases
rob
night
robber
planning
flower
finishes
ten
wordslength
kilometers
speedi
encode
mini
environment
wordsj
y-coordinate
appeared
interested
amounts
distributed
visible
files
better
stick
paid
expansion
quantities
knight
17
gap
deeply
attended
begins
reversing
aforementioned
numi
paired
ties
strange
spiral
--------------------------
constructs
rate
ranking
disconnected
getting
bounds
look
removekey
startdayi
enddayi
attending
penalty
searches
transpose
picky
fee
equations
equationsi
-10
keyi
quotation
1001
destroyed
12345
reminder
parentsi
queen
processed
val1
val2
valued
abcc
reduces
34
timesi
heightsi
photo
checker
startrow
shuffling
apples
plot
imagine
obstaclesi
simulation
aab
gridrowcol
enters
customersi
owner
buckets
liters
0-based
denominator
alternately
preparing
ingredients
ranging
objective
cd
bought
parity
captured
behind
touches
ik
sheet
28
excel
spreading
planting
cache
frequently
putint
mm
59
seatsi
plants
uncolored
colori
tweets
tweet
context
logged
a3
reading
eventually
-9
factory
show
throws
mouse
eaten
guards
distributions
matrices
entirely
xn
genetic
flipped
pyramid
iterates
cpu
erase
decrypt
drawing
poor
di
losing
touching
forgot
commas
gcdx
str2
str1
numsr
5th
dont
independently
peoplei
project
parser
unlocks
password
checked
evaluated
variables
legal
choices
assumed
accept
amounti
income
fruits
effect
calculations
lying
pickup
edgesj
xi1
reordered
assignment
quadruplets
xored
positionsi
occupy
past
1-based
nums1j
directory
p2
callback
enhances
fnarri
acceptable
swapped
costsi
hire
basic
deepest
bef
lexicographic
determines
32
itemsi
run-length
marking
volume
75
vals
chars
in-order
majority
staircase
climb
prerequisitesi
numcourses
flight
105
aaa
partially
half-open
cab
filter
distancei
numerals
64-bit
s0
salaries
placement
arrangements
len
managerid
managers
candiesi
magical
corners
2-d
warehouse
pos
existed
redundant
--------------------
exchange
prerequisite
relations
matij
asks
importance
height-balanced
3sum
judged
pays
requires
wish
upcoming
forest
backwards
comprise
dollar
updated
plots
1d
ip
weightsi
member
members
flattened
graphij
adjacency
spread
blank
regions
elevation
closing
afterward
reject
old
executing
promise
asyncronous
an-1
unrooted
guarantee
big
typically
offers
left-to-right
1101
dead
dies
res
signal
singly-linked
designed
typei
xy
axes
2-dimensional
formats
attain
meetings
shared
uniquely
individual
unary
even-indexed
odd-indexed
loss
someday
device
listed
activities
favorite
hands
1-9
grid00
gridm
1n
successfully
arrivali
k-1
24
addresses
well-formed
profiti
obtaining
scheduled
pressed
successive
arrleftright
info
getrandom
testing
feed
live
targetsum
6-sided
save
nobody
instruction
drives
stays
contents
primes
lock
ancestors
locked
listinteger
movies
movie
covers
chess
occupies
driving
bsts
multiplicity
subgrid
holding
absnumsi
tuples
traveled
row1
col2
col1
row2
subgraph
merging
graphi
pushed
videos
press
fifth
contest
bookint
implementing
correspond
deque
double-ended
tell
startvalue
ix
principle
six
boardrc
buses
catch
experience
monotone
conflict
delivery
police
contact
alerting
stashed
invert
held
contrast
bloom
worked
fractional
comprises
depending
simulate
normal
implemented
lies
years
short
disti
temperature
summary
tells
assertions
expectednumsi
assert
expectednumslength
expectednums
maximizes
respect
buffer
viewed
retrieves
ring
aligned
violating
degree
departmentid
departments
dimensions
folders
110
non-leaf
sticks
drive
ride
arriving
elapsed
solved
bricks
identify
list1
list2
few
manhattan
06
312
submatrix
aba
yyyy-mm-dd
parameters
booleans
cutting
spell
restore
delayed
subjected
widths
staying
unsigned
arr1i
arr2j
alength
aec
giving
255
uncommon
pairings
rangesi
though
coefficient
reuse
notation
truncate
pointing
bounded
deep
fx
chain
collision
collisions
action
ranked
fuel
region
selecting
2020
preferred
force
dominoes
non-intersecting
maxsum
movements
sequential
---------------------------
escape
dividing
stacks
difficulty
upper-case
numsk-1
unchanged
myhashset
hashset
containskey
addkey
server-to-server
incur
closes
fstring
suff
wordfilterstring
wordfilter
ryan
tm
t3
interleaving
hhhvv
providing
hvhvh
dj
contradiction
knowledge
knowledgei
nameisageyearsold
semi-ordered
base-10
2-mirror
base-2
k-mirror
contrary
base-k
smash
parents0
king
faces
asterisks
forth
bars
reduced
init
coprime
options
afterwards
predict
separation
non-digit
votes
tied
vote
startcol
home
doubled
transformed
bonus
mirror
growing
squared
commands
requestsi
transfer
reside
transfers
coloring
2h
h2o
optionally
differing
maxtime
throughout
till
capacities
foo
pid
inner
cream
ice
stonevalue
a-b
punctuation
matrixrowcol
pointslength
enemy
army
richest
lot
sea
borders
truck
sends
ages
appropriate
agesi
percent
bill
printnumber
fizzbuzz
buzz
prints
fizz
console
numsik
i2
ch
relationships
news
subordinates
gardens
flowersi
incomplete
recently
incremented
maintained
invalidate
answerx
definitely
situation
url
browser
tab
page
history
hh
studentsj
watering
refill
plantsi
tweetid
app
const
obj
quote
sourcei
precedence
yet
interfere
effective
defines
121241510
-5
2510
copied
infinity
countint
driver
supposed
addnumint
thrown
words1
words2
polygon
convex
triangles
vps
maxdeptha
deptha
depths
vpss
depthb
instructed
cheese
likes
gone
landing
frogs
images
erased
fresh
rotten
orange
oranges
resets
took
expressed
powx
isleaf
logical
recurse
bottomleft
wiki
sub-grid
quad-tree
bottomright
proper
topleft
sub-grids
terminator
inputoutput
topright
grids
gcdnumsi
stacking
patterns
bac
triangular
stacked
shifta
shiftsi
multi-dimensional
scheduler
cooldown
erasure
lr
keysi
decrypted
permitted
gains
vii
potentially
realized
2th
1100
reused
segmentation
worddict
matched
wordlength
108
lcm
self-edges
linked-list
linked-lists
divisibility
shot
burst
flat
diameter
arrow
bursting
skills
skill
decrements
entered
012
checking
345
safe
incorrect
protected
typing
performs
nextint
collects
stocks
concept
e1
innermost
convenience
e2
parse
mutate
profitable
reward
k1
nums2i2
k2
fruit
attacking
mines
speciali
rented
designated
manages
tic-tac-toe
cherry
cherries
bj
x3
cyclic
ideal
verifying
subjects
university
subject
maxsize
boomerang
weak
strong
firsti
solvable
hit
rook
rooks
bishops
piecesi
bishop
idx
fancy
space-separated
researchers
cited
published
citations
researcher
citationsi
h-index
papers
findint
slashes
filedirectory
directories
slash
refers
90-degree
angles
chalkboard
sessions
eval
fn-1
f2
abcdefuvwxyz
vyz
sure
layers
layer
converts
whitespace
ignore
excluded
ccc
compression
compress
durationi
2k
replacements
targets
eee
025
serve
someone
multiples
climbing
stairs
cheapest
flights
songs
song
bacd
abcba
sleftirighti
modifies
optimize
matrixij
tracks
restaurants
maxdistance
ratingi
filtering
reformatted
computing
0110
listnode
monthly
category
wooden
ant
n-queens
223
natural
backspace
tilesi
relation
s1i
requirement
dash
formatting
parent0
gas
tank
hits
spanning
shaped
dropping
spans
tails
internally
extended
anti-clockwise
pizza
slice
saleid
worth
cellsi
ij
edit
budget
attempt
1010
situated
walked
pascals
forwards
prefixes
single-space
doctors
ipv4
replaces
extending
brings
package
packages
port
load
ship
meters
book
chunked
b1
curr
doubly
rollsi
minitial
malware
leftover
rising
minimums
summing
respecting
indexes
departs
departure
ticketsi
elimination
1337
promises
pool
pending
executes
lakes
a4
obeys
communicate
shopping
awesome
specify
joined
0001
successor
older
death
family
birth
kingdom
initialize
tested
traversed
3d
viewing
cubes
optional
bs
lca
eligible
award
attendance
absent
late
mixed
frame
meetingsi
pre-order
strengths
weakest
rational
express
got
duplicated
originally
capture
sij
logging
deviceid
eventdate
playerid
gamesplayed
pairing
loop
rowj
colj
ansj
gridrowicoli
activitytype
active
insertstring
angle
populate
populating
struct
sudoku
sub-boxes
gridi
buyerid
sellerid
quarter
2019
party
mail
asteroid
asteroids
mass
abcdefghijklmnopqrstuvwxyz
wiggle
redistribute
scheduling
examine
transactionsi
decomposition
fi
race
removeint
maze
exit
entrance
bridge
efficiency
efficient
waits
recorded
updateint
orderid
join
liquid
pig
bucket
allotted
fed
numsnumslength-1
describing
57
sake
half-closed
followerid
repaired
ranksi
repair
50ms
60ms
400ms
100ms
30ms
iteration
opponents
sections
appearing
cousins
equality
bbb
tiling
locks
preserved
uniformly
drops
carries
searchint
involving
puts
layout
spent
digitsi
tuesday
sunday
monday
xi2
fibonacci-like
si1
encodedi
proved
sumrangeint
numarray
numarrayint
numsindex
cat
metal
glass
2x
startj
treesi
throw
completing
reserved
population
million
node1
node2
structurally
4237214
242
274
machines
plan
laser
displays
consistent
selection
fulfilled
overlapped
leads
intersections
pairwise
heads
ahead
correctly
separately
popped
single-threaded
exclusive
identified
xxxx
row-wise
finishing
permute
downwards
isfull
rear
isempty
xx
iiii
400
roman
numeral
xii
xxvii
900
usually
plate
slot
rides
applications
extension
unrevealed
revealed
mine
yield
summer
costij
33
housesi
leftright
personid
exceeding
master
guessed
guesses
strategy
snake
simulates
ladders
minimizes
widthi
incoming
02
programming
term
creating
fs
ty
tx
sy
sx
referred
graphs
biggest
45
service
456
bash
6th
tonight
professional
collecting
intersecting
surface
seed
growth
rx
chef
sub-tree
farmland
inverse
attribute
natively
queues
peekpop
supported
advances
outcome
lined
warm
provides
eliminate
floating
180
empid
unequal
covering
213
targeti
performance
engineer
speeds
exceeds
carry
kept
removeduplicatesnums
classes
restriction
deserialized
compact
serialize
link
deserialize
drawn
circumference
numsa
numsd
numsc
numsb
4sum
answersi
worst
traffic
sensitive
comma
views
article
dag
halve
tripsi
post
fifo
codes
wheel
turning
non-null
repetitions
targetx
finite
targety
routine
week
great
companys
transferred
10000
trimmed
trim
fewest
pad
carpetlen
namesi
instantly
stopping
processing
ascii
taxi
newly
reply
arrived
robbing
maxi
stamping
rightward
guarded
knights
skipped
120
210
energy
training
furthest
farthest
indirect
rests
slowest
presses
pushing
movecost
80
cook
prepending
numsl1
numsr-1
triples
sub-array
numerically
fashion
cipher
cartesian
pixels
stopped
extract
disappear
brick
temperatures
arr1length
cancelled
depositint
withdrawint
withdraw
deposit
treenode
limits
limitj
comparing
identifier
ratings
19216811
aebdc
aeb
index1
index2
soldiers
signs
reporting
seqlength
seqi
blength
waste
systems
0190
compiler
java
union
uniform
ycenter
xcenter
3x
foods
prefers
preference
searchstring
bug
yes
grammar
installed
73
divisions
102
totally
non-equal
-7
advance
stamps
retrieve
modifications
parsed
cinema
odd-numbered
stands
similarity
colsum
18
traversing
os
datetime
timeout
tracker
studentid
stationsi
liter
miles
boy
groupi
february
decki
deck
disconnect
-k
mode
cba
roomsi
--------------------------------------
aalength
strongest
tables
dominoesi
numrows
installing
spreads
install
contaminated
uninfected
faster
bijection
movesi
resolved
peek
aajf
a-z
11106
grouping
kjf
molecule
abbreviated
wasted
floating-point
fruitsi
produces
handling
worry
cup
cups
tour
timej
cookies
latter
former
safely
efficiently
queryint
immutable
rope
batch
serving
related
attempts
pj
halves
biginteger
rods
rings
dial
k-sum
completes
expiration
unused
things
important
gold
nums2i1
freq
bomb
align
button
shouldnt
computers
processes
operating
popular
js
maintain
newnums
newnumsi
f3
labelsi
ticket
wonderful
raining
trapping
trap
alphabetic
tuple
lower-case
printer
tries
cancel
cancellable
rootval
hexadecimal
one-lane
fleet
collides
entry
bound
citys
contour
increased
skyline
beginword
wordlist
endword
coinsi
tag
an-2
partner
235
numsn-1
numsk1
scoresi
clone
cloned
4567012
0124567
cached
memoize
memoized
copies
flood
monitor
spellchecker
ground
comma-separated
distributing
buttons
boxesi
smart
nums0i
x0
powers
stationary
egg
breaks
eggs
certainty
unbroken
everybody
f0
p0
success
truncates
bulb
bulbs
switcher
ipo
30make
reshape
k-concatenation
equalize
allocator
viii
numsij
maxbik
bij
sized
heaviest
queensi
yking
ad
xqueeni
yqueeni
xking
kn
face-up
fninit
reducer
arrayreduce
fnval
validly
gcdval1
salaryi
dv
dva
super-palindrome
super-palindromes
10921
a123bc34d8ef34
cast
election
topvotedcandidateint
topvotedcandidate
personsi
qint
annual
expectedi
leaf-similar
rowcostsr
colcosts
homerow
colcostsc
rowcosts
homepos
homecoming
incurs
homecol
up-left
buddy
cbad
symmetric
neededapples
yourself
coffee
enjoy
enjoyyourcoffee
-y
season
achievable
getkthancestorint
treeancestor
treeancestorint
h2o2
atomic
chemical
h2o2he3mg4
h1o2
formulas
atoms
h2o23
atom
10-6
countuniquecharst
countuniquecharss
passingfees
passingfeesj
fees
grumpyi
grumpy
technique
bookstore
jugs
measurable
measure
jug2capacity
pour
jug1capacity
jug
targetcapacity
sumfirst
sumsecond
irreducible
printfoo
printbar
foobar
stonesj
topping
dessert
toppingcostsi
toppingcosts
basecostsi
basecosts
flavor
flavors
toppings
lane
obstacles2
lanes
sideway
maxheighti
restrictionsi
hyphens
ba-c
afad
ab-
-ab
hyphen
numselect
cnumselect
buys
cabxbae
cxbae
ba
cabxe
zxcvbnm
qwertyuiop
american
asdfghjkl
x-values
12312
minij
fortsi
fort
fortsk
maxij
forts
gifts
oceans
ocean
heightsrc
pacific
flow
atlantic
boxtypesi
trucksize
numberofunitsperboxi
boxtypes
numberofboxesi
patientid
hospital
diabetes
patients
patientname
diab1
agey
agex
2582
3245
paying
productj
cashierint
frequented
getbillint
amountj
subtotal
groceries
supermarket
productsi
purchased
cashier
12344
transformable
14234
largest-valued
buzzprintbuzz
printfizzbuzz
fizzprintfizz
printfizz
multithreaded
numberprintnumber
fizzbuzzprintfizzbuzz
fizzbuzzint
printbuzz
numsi2
numsi0
abcdefd
dcbaefd
columnnumber
urgent
managerheadid
informtimei
headid
subordination
manageri
inform
caretaker
newflowers
lfu
lfucache
invalidated
lfucacheint
rich
quiet
quieti
quietness
quiety
richer
logically
loud
richeri
cardsi
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
browserhistoryvisityoutubecom
browserhistoryvisitgooglecom
browserhistoryback1
googlecom
backint
browserhistoryvisitfacebookcom
homepage
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
linkedincom
forwarding
browserhistoryleetcodecom
facebookcom
browserhistoryforward1
browserhistorystring
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
forwarddesign
5000
browserhistoryforward2
youtubecom
browserhistory
homepagelength
browserhistoryback2
browserhistoryback7
urllength
forwardint
visitstring
clears
browserhistoryvisitlinkedincom
candidate
capacityb
waters
alicebob
hisher
cans
capacitya
aval
bval
3-same-digit
taxprice
taxcallpolyfillitem
callpolyfill
salad
functioncall
thisitem
consolelogthe
tax10
appropriately
totalcost
taxrate
this1
sentence4
is2
by2
ax2
bx2
ay2
ax1
ay1
by1
bx1
rectilinear
control
comment
macros
comments
implicit
newline
envelopes
russian
envelopesi
envelope
doll
paste
notepad
screen
highlimit
lowlimit
perpendicular
detectsquares
compile
numsdivide
findmedian
medianfinder
x-matrix
abcabc
k-similar
triangulate
triangulation
n-sided
depthc
elementary
grade
submitted
math
352
rewarded
eg
reward2i
reward1
reward1i
reward2
mice
bananas
loves
koko
slowly
bananas-per-hour
classroom
cheating
assumes
translation
translate
translated
img1
img2
sright
sleft
rotting
elapse
snapid
snapshotarrayint
snap
snapshot
getindex
array-like
setindex
snapshotarray
hourglass
raised
parentsx
nodei
exclusively
cornered
quadtree2
quadtree1
quad-trees
matrixes
switching
isomorphic
preserving
traversals
transition
beneath
pleasing
three-letter
aesthetically
shiftz
shiftt
yielding
encounters
alal1ar
carried
encryptstring
encrypted
encrypterchar
encrypt
encryption
encrypts
decryptstring
encrypter
decryption
maxpts
draws
plays
loosely
outcomes
probabilities
tokensi
gaining
storeroom
cubic
cube
seperate
wrote
one-hour
keycard
keytimei
keynamei
0949
keyname
key-card
2352
alert
emits
keytime
2351
2251
saves
doors
key-cards
worddictionaryaddwordmad
worddictionarysearchad
worddictionary
nullnullnullnullfalsetruetruetrue
searchdesign
addword
baddadmadpadbadadb
worddictionarysearchb
worddictionarysearchbad
worddictionaryaddwordbad
worddictionaryaddwordaddwordaddwordsearchsearchsearchsearch
addwordword
worddictionarysearchpad
worddictionaryaddworddad
hasapple
hasapplei
non-coprime
bipartite
graphv
graphu
divisorsi
taped
spherical
y-coordinates
xend
xstart
stretches
y-direction
answerij
matrc
001101
inspection
variety
official
quad
understand
2143
4123
4321
pseudo-palindromic
people3
people1
sufficient
reqskills
people0
getmaxkey
getminkey
allone
incstring
oone
decstring
al
interpret
parsers
interpretation
peculiar
012345
cracking
crawler
span
73412
stockspanner
today
quotes
todays
7212
sumnumsi-numsj
en
scopes
lisp-like
lisp
vn
mult
syntax
scope
expr
v2
v1
k-bit
mutations
investigate
8-character
aaccggtt
aaccggta
startgene
endgene
mutation
gene
cash
gate
pricereward
reduction
nextlargest
basket1
basket2
minbasket1ibasket2j
hero
poisoned
ashe
timeseriesi
teemo
attacks
poison
timer
timeseries
arms
gridxiyi
relevant
minesi
10101
careful
relaxation
xk
k-repeating
devise
jobsi
surprisingly
alien
dislike
bipartition
dislikesi
dislikes
taught
subjectid
deptid
teacherid
teaches
pops
customstackint
incint
customstack
xoring
xor-beauty
baaabb0
baaba0
tn2
tn1
n-th
t0
tribonacci
tn3
tn
quadruplet
secondi
verbal
pins
bowling
2xi
player1
player2
sentencesi
c-1
r-1
unfixint
bitsetint
compactly
tostring
bitset
fixint
coincide
minnumsi
segmented
logarithmic
inequality
changeint
numbercontainers
fills
simplify
unix-style
canonical
pickint
p4
p3
arraygroupbyfn
groupby
mistake
touch
rec2
rec1
32772
327712
hiring
completeness
fn-2
strs0
strs2
strs1
strsn
cyclically
atoi
0032
clamp
clamped
ccs
myatoistring
beautyi
-123
mex
103
a2bc3
c3
aabccc
enclaves
lastdayi
coursesi
targetsi
testcase
abbc
sourcesi
eeecd
sources
soup
mls
ml
servings
bstiteratortreenode
bstiterator
non-existent
initializing
grid1
sub-islands
sub-island
grid2
rungs
rung
flightsi
dst
src
playlist
listen
music
boredom
playlists
queries1
queries4
330120031032041
letterscan
queries3
queries0
queries2
lyb
010221
palidrome
falsetrue
abcda
truefalsefalsetruetrue
baab
abba
isconnectedij
provinces
province
isconnected
overlaps
queryrangeint
addrangeint
removerangeint
rangemodule
tracked
module
tracking
vegan-friendly
veganfriendlyi
veganfriendly
restaurantsi
maxprice
filters
well-spaced
1549
49
original0
originali
derivedi
groupsizes1
groupsizes
groupsizesi
min-product
325
1110
serializations
accountid
50000
categories
20000
plank
ants
1238
5678
5674
abcbabcbcb
ababbc
ac
baa
primefactors
currenttextlength
simulating
cursorleftint
texteditor
deletetextint
editor
addtextstring
cursor
cursorposition
min10
cursorrightint
numsi-1numsj-1
lonely
rcenter
ccenter
containedboxes
initialboxes
containedboxesi
statusi
equivalency
s2i
implies
symmetry
acd
reflexivity
transitivity
cde
eed
basestr
equivalence
curs
cur
workersj
pills
pill
requiring
license
gasi
circuit
uni-valued
univalued
conversions
k-subarray
redirect
boards
stuck
redirects
storekeeper
pizzas
3n
2d-array
arraymap
returnedarrayi
selects
124789
37
23489
89
indistinguishable
marksi
typesi
counti
flooded
rith
cith
bottles
bottle
drink
drinking
numexchange
numbottles
months
prevcoursej
relationsj
nextcoursej
logn
om
logm
numsstarti
numsendi
maxchargetimes
chargetimesi
chargetimes
charge
sumrunningcosts
runningcosts
runningcostsi
semester
nextcoursei
semesters
relationsi
prevcoursei
patches
addpatch
patching
mountainarrayget
mountainarray
mountainarrgetindex
disqualification
mountainarr
submissions
interactive
mountainarraylength
mountainarraygetk
circumvent
1321
array-form
type-2
type-1
bring
bannedi
arrbannedi
bills
lemonade
billsi
hiker
hike
rows-1
columns-1
hope
effort
heightsrowcol
golf
rowindex
rowindexth
-100
imaginary
realimaginaryi
multiplications
complex
length-3
mxy
ops
opsi
preceded
1e5
daysi
applesi
rot
grows
sumnums0numsi
runningsumi
defanged
defanging
fixed-width
widest
remembers
loweri
higheri
belonged
x1y1x2y2xnyn
x1x2xny1y2yn
wraps
conveyor
shipped
belt
divi
word0i
div
distance1
distance3
distance0
distance2
maxrow
spectators
vary
scatterint
concert
bookmyshowint
allocates
hence
gatherint
hall
bookmyshow
ticketing
namely
single-level
currnext
multilevel
sided
rolling
pathi
priority
targetword
021
firstword
secondword
chocolates
debt
backslash
escaped
columntitle
everywhere
swim
minb
airline
itinerary
man
jfk
lexical
itineraries
airports
lga
lgb
pow
extremely
y22
x22
functionsi
promisepool
resolves
horizontallyvertically
isnt
incurred
transitive
languagesi
teach
friendship
friendships
friendshipsi
sslength
goods
rid
illegal
conductor
reservation
manage
fetches
seatmanagerint
unreserveint
seatnumber
unreserves
smallest-numbered
reserve
unreserved
seatmanager
reserves
orient
reorienting
ministry
transport
narrow
zero-filled
specialin
specialij
offer
needsi
version1
revisions
version2
revision
2533
1111
0011
2p
successoralice
kingname
birthstring
grandchildren
well-defined
gave
successorxs
jack
successorbob
throneinheritance
throne
successorjack
curorder
whos
throneinheritancestring
parentname
born
successorking
getinheritanceorder
son
childname
oldest
deathstring
inheritance
successorx
iteratorhasnext
nestediterator
nestedlist
nestediteratorlistnestedinteger
iteratornext
pseudocode
cy
garbled
towersi
qi
qualities
towers
cx
web
developer
pages
traversable
comprised
necesssarily
84351
2314
n-bit
gray
shadow
zx
looking
projection
yz
projections
planes
3-dimensional
pricesj
150
-01
0089
314
535e93
e3
-90e3
-123456e789
2e10
1a
1e
3e7
--6
6e-1
99e25
95a54e53
aacabb
bbcbaa
aecdb
grandparent
even-valued
croaking
croak
printing
croaks
croakoffrogs
firstperson
secrets
457
333
voyage
wizards
wizard
ruler
strengthi
chips
chip
op2
negation
adhere
op3
conventions
op1
mismatch
pawn
pawns
captures
sxy
max15
44
max6
barcode
barcodesi
distant
barcodes
eyes
puppy
legs
infrastructure
citybi
cityai
lamps
gridrowjcolj
answering
lamp
lampsi
illuminates
illuminated
illumination
beans
bean
opensession
endsession
activitydate
2019-07-27
sendmessage
sessionid
scrolldown
sumstring
key-val
mapsum
overridden
organizing
favoritei
invited
seating
capable
solver
3x3
gridin
computational
handled
i2th
loadi
busy
busiest
operationsi1
operationsi0
2019-03-31
unitprice
2019-01-01
saledate
chairs
chair
leavingi
targetfriend
plotting
stockpricesi
chart
stockprices
dayi
aliceleetcodecom
myemailcom
forwarded
filtered
mails
mynameemailcom
everything
emailsi
alicezleetcodecom
planet
destroying
asteroidsi
134
competitive
za
kencodedstring
3a
encodedstring
evenprintnumber
zeroevenodd
printnumber7
010203040506
zeroevenoddint
oddprintnumber
zeroprintnumber
acbd
cbda
targetwords
startwords
square-free
youre
sometimes
cashbacki
subtext2
subtexti
subtext1
subtextk
sqrtx
exponent
python
superstring
tire
lap
laps
tires
rix-1
tiresi
numlaps
changetime
spliced
nums1leftright
nums2leftright
1112131415
11231415
sumnums1
sumarr
sumnums2
1121345
accommodate
sells
tastiness
non-bull
xayb
ask
cows
hint
bulls
bba
bababcba
bbabba
randomizedset
aabd
wordin-1
wordjn-1
lcp
aaca
lcpij
entrancerow
entrancecol
lefttorighti
righttoleftj
regulate
lefttorightj
warehouses
righttolefti
putnewi
pickoldi
minima
maxima
mindistance
maximaminima
orderly
zero-based
numsnumsi
solutionlistnode
stockprice
correcting
volatile
nature
fluctuation
worse
itembrand
buyer
joindate
favoritebrand
itemid
s2j
overwriting
camelcase
consume
poisonous
survive
minutestotest
pigs
minutestodie
numsmiddleindex1
middleindex
numsmiddleindex2
numsmiddleindex-1
references
numones
numnegones
numzeros
-1s
numzeroes
remainder
thin
rather
paintingj
rightj
mix
segmentsi
1412477
246
mixj
47
leftj
145177
followers
follower
maxoperations
mechanic
garage
mechanics
went
fortunately
observations
observation
40ms
throttle
overwrite
throttled
80ms
consuming
graphical
cae
bce
walks
4-directional
non-obstacle
kitchen
index-0
uniques
bobarrows
bk
numarrows
scoring
archery
shoots
ak
alicearrows
revnumsi
rev120
revx
revnumsj
rev123
successors
accelerate
aar
12321
paragraph
case-insensitive
xiyi
one-letter
xiyihere
satisfiability
basically
stages
endi-1
pairslength
pos1z
pos2v
pos2x
pos2z
pos1v
pos1y
pos2y
pos1x
tilings
tromino
unlocked
lockingtree
upgradeint
lockingtreeint
locking
upgraded
prevents
lockint
upgrade
unlockint
s1s
n-digits
mat20
mat31
mat42
referentially
subscribing
eventemitter
enables
nodejs
callbacks
emitter
subscriptions
emitting
unsubscribe
subscribed
emit
emitted
dom
listeners
subscribe
carefully
ballsi
listlistinteger
shops
searching
moviei
shopj
dropint
resj
rental
moviej
movierentingsystem
movierentingsystemint
generating
unrented
rent
entriesi
rentint
rents
renting
shopi
forwardbackward
numsseqj
seqk
seq0
seq1
6174
6741
6141
61741
mhts
minh
fingers
133
arrivebob
rome
5-character
leap
leavealice
mm-dd
business
arrivealice
31
leavebob
finalsum
top-to-bottom
orderings
recyclable
fat
lowfats
revenue
janfebmaraprmayjunjulaugsepoctnovdec
putting
odds
1-d
numsy
numsw
numsz
numsx
logout
0045
0015
2345
0130
logouttime
logintime
midnight
seventh
alicesizesi
bobsizesj
alicesizes
bobsizes
1021
mutable
hole
graph1
grapha
trucks
garbage
traveli
assortment
responsible
garbagei
treesj
startcolumn
maxmove
nottobeval
developers
expect
helps
tobeval
abccdef
cbca
caaacab
insensitive
licenseplate
12c
corporate
bookings
lasti
bookingsi
multipliers0
multipliers
multipliersi
multipliers1
25000000
twenty-five
continent
3000000
countries
gdp
km2
bigint
accountsij
wealth
universal
warrior
wrr
changedate
newprice
2019-08-16
averagea
averageb
averagearr
ensures
subgrids
reindexing
4253
operands
unvisited
losers
indexdiff
valuediff
dresses
washing
dress
bigger
turbulent
comparison
beams
beam
while1
banki
devices
activated
noderight
nodeleft
traverses
checkout
checkoutint
endstation
checkinint
chronological
getaveragetimestring
stationname
checkin
railway
startstation
underground
undergroundsystem
getaveragetime
rededgesi
blueedgesj
blueedges
rededges
getvalueint
rowcol
row1col1
subrectangle
updatesubrectangleint
newvalue
subrectanglequeries
row2col2
editors
backspacing
src1
constituent
lastly
src2
dest
delightful
soul
sound
cool
exercises
eetcode
arraylast
prototype
terminal
eventual
states
firstlist
firstlisti
secondlistj
endj
secondlist
skipb
lista
skipa
listb
headb
intersected
heada
intersectval
retain
functionidstart
1end2
endtimestamp
0start3
numsi-1
watchedvideosi
general
watched
friendsi
watchedvideos
punishment
heshe
abbxxxxzyy
36
bb
yy
texting
texts
transmission
pressedkeys
2266622
column-wise
n-1-ith
twins
twin
shortestpathint
addedgeint
graphint
edgecosti
edgecost
labelling
sixth
yi1
rectanglei
yi2
sessiontime
mittal
danny
sneakily
remap
remapping
remaps
d1
congratulate
d2
weekly
326
permuted
no-zero
subtracted
diffi
particularly
mycalendartwo
getrear
insertfront
mycirculardeque
mycirculardequeint
deletefront
getfront
deletelast
insertlast
pre-defined
guessint
almost
mysterious
func
funcarr
step-by-step
destvalue
k-increasing
arr4
arr5
arri-k
arr3
tenth
possibilitiestenth
theres
10th
explore
accountsi0
accountsi
uvwxy
klmno
fghij
board00
pqrst
candle
plates
candles
concatenates
numslots
passengersj
busesi
travelleddistance
travellers
helloo
heeellooo
expressive
ooo
helllllooo
stretchy
oo
feeling
lllll
ll
hiiii
hellooo
char
clickc
revealing
minesweeper
click
clickr
num1num2
maxm
2m
12233211
neighborhoods
neighborhood
es
aaaeeeooo
aaaaaaeiiiioou
aeiou
aeoiu
uaeio
personname
turn1
kilograms
turnn
reasonable
masterguessword
bruteforce
masterguess
six-letter-long
helper
allowedguesses
getindexidx
multall
appendval
addallinc
multiplies
addall
inc
multallm
smoother
surrounding
grayscale
rounding
img
style
boustrophedon
mincurr
destinations
snakes
boardn
-14-13
heap
nim
findsumpairs
findsumpairsint
tot
nums2index
interchangeable
width-to-height
widthiheighti
widthjheightj
consisiting
ababc
exceeded
fullfill
approved
declined
transdate
dfs
depth-first
03
additive
x--
--x
fix
streak
ors
skilli
chemistry
countandsayn-1
countandsayn
3322251
countandsay1
count-and-say
saying
judgement
1-dimensional
text1
text2
fqueriesi
dcce
fw
rmove
cmove
toeplitz
refereeid
referee
histogram
histograms
store1
store2
store3
suggests
suggestions
suggested
starttime2
starttime1
event2
endtime1
event1
endtime2
aware
discovers
discovering
forget
pseudo-critical
mst
msts
purple
depicted
rhombus
xcentre
ycentre
2d-map
centre
456-7890valid
xxx-xxxx
xxx-xxx-xxxx
456-7890
xxx
7890
987-123-4567
one-liner
meanwhile
additions
nextvisiti
nextvisit
sectors
sector
marathon
roundsi
rounds0
circulate
rounds1
k-length
purchasedate
startdate
enddate
unitssold
averageprice
arrx
arry
irregular
glue
pointsrc
absc1
blooming
seeds
growtime
growtimei
planttimei
blooms
planttime
bloomed
xl
rxxlrxrxl
lx
xr
neg
prepare
prepares
recurring
numerator
enclose
k-group
alter
left-out
barren
pyramids
farmer
bottommost
fertile
pyramidal
apex
lon
latitude
longitude
policyholder
2015
tiv2016
investment
policy
2016
policyholders
investments
tiv2015
lat
holders
insurance
mystack
lifo
last-in-first-out
firstplayer
competes
against
compete
winners
secondplayer
numsinumslength
numsii
357
159
subpath
warmed
heater
heaters
senior
citizens
gender
directioni
acquire
indiceslength
10010
00001
00010
ys
charged
defending
chargethe
weapon
monsters
monster
27315
fahrenheit
3200
kelvin
celsius
supervisor
wordsjk
unusuable
secondlen
firstlen
disappeared
engineers
efficiencyi
evict
lrucache
lrucacheint
lru
differencei
wordsij
differenceij
equal-length
wordsij1
boat
boats
3825
exhaust
encodingi
rle
88855
exhausts
380925
rleiterator
281825
rleiteratorint
exhausted
prefixi
totali
brilliant
extrastudents
beforehand
ratios
classesi
passi
unreachable
maxjump
minjump
orderwith
serializationdeserialization
reconstructed
transmitted
lattice
circlesi
circles
signfuncproduct
signfuncx
countsi
rabbit
rabbits
poker
flush
suitsi
suit
suits
case-sensitive
answerrowcol
rankq
rankp
signals
jewels
couple
couples
switch
pillow
2maximumbit
maximumbit
features
arraywrapper
wrapper
author
viewerid
articleid
viewer
authors
articles
viewdate
authorid
non-adjacent
getnewsfeedint
unfollowing
twitter
followint
posttweetint
unfollowint
followeeid
composes
posted
followunfollow
dequeue
enqueueint
benefits
mycircularqueuek
mycircularqueue
brushing
freezes
sidelengthi
landed
wheels
wrap
deadends
end-nodes
abcabcabc
bolded
n1
str
abdbec
mynumbers
bigram
numsri
numsli
numsli1
thereafter
pictorial
milestones
milestone
milestonesi
weeks
violate
projects
new2
92
new1
93
329
2932
maxdoubles
earners
earner
earns
executives
seeing
transactedon
transid
heavy
bulky
categorize
trimi
kith
numsik2
maxnumsi0
minnumsi0
heroes
filesystem
leetcodeproblems
sub-folder
folderi
folderj
sub-folders
tiring
non-tiring
well-performing
integer-sided
inverting
left-justified
justified
pack
maxwidth
greedy
justification
approach
numcarpets
floori
carpets
pattern0
pattern1
one-to-one
omit
childrens
evaluations
act
enqueuetimei
processingtimei
cutsi
maxcost
ti
unidirectional
ridesi
tip
requesting
earnings
willing
tipi
replies
channels
patiencei
resend
resending
originating
periodically
patience
channel
evil
averageamount
visitedon
analyze
distancetolastnodezi1
z1
z0
z2
zi1
distancetolastnodezi
zi
distancetolastnodex
zk
thieves
securityi
duty
gang
cost2
pencil
utensil
pens
pen
pencils
cost1
102001
121000
left-most
targetlength
stamp
stamped
fight
dungeon
threats
imprisoned
power-ups
decides
rescue
orbs
demons
princess
quickly
upon
laid
health
valiant
110100010
brainpoweri
brainpower
decision
questionsi
transactionid
visitid
mall
secondary
extrovert
living
extroverts
introvertscount
introvert
introverts
happiness
extrovertscount
0120
001112
subsequence1
subsequence2
initialexperience
energyi
opponent
experiencei
initialenergy
defeating
defeat
hi1
myhashmap
hashmap
needle
haystack
wallet
assorted
splicing
tasksj
serversi
priorities
prison
vacant
non-star
stars
1221121221221121122
zbax
262124
suffixes
unnecessary
2d-plane
skips
skipping
hoursbefore
kmh
letting
3-digit
keypress
keyspressed
keypad
tester
releasetimes0
releasetimes
releasetimesi
keyspressedi
keypresses
released
unmarked
cooking
targetseconds
interprets
fatigue
startat
pushcost
0954
finger
99
normalizes
81
normalized
54
microwave
generic
multiplicand
matrixxy
instructionsi
min2
12335
1235
ababb
arri-1
gregorian
bitwise-and
primaryflag
joins
flag
5247
567
arrayflat
flattening
ordersicustomernameitablenumberifooditemi
customernamei
header
tablenumberi
fooditemi
pr
transposition
ciphertext
accessed
encodedtext
slanted
originaltext
depict
tape
frontmost
popmiddle
popping
pushfrontint
pushmiddleint
pushbackint
popfront
frontmiddleback
popback
sum123
curried
curry
csum123
practical
alone
mirrored
introduced
rollmax
rollmaxi
simulator
greatness
permuting
upper-left
streets
trios
trio
lexographically
colums
stickers
sticker
registered
register
username
contestid
decimals
booleanvalue
falsy
librarys
absx1
absy1
1351315
551
whitespaces
hamstersi
hamster
hamsters
delayedtime
arrivaltime
24-hours
11110xxx
10xxxxxx
n-bytes
unicode
octet
utf8
validation
byte
110xxxxx
translates
-------------------------------------------------------------
0xxxxxxx
1-byte
1110xxxx
bytes
utf-8
result1
result0
widths0
widths1
excavate
mud
artifactsi
underneath
c1i
c2i
digi
dig
buried
uncovered
artifact
r2i
extracted
r1i
artifacts
indexs
exams
scoreij
negabinary
-20
-23
-22
stable
hitsi
erasures
guessing
bobvalues
alicevaluesi
alicevalues
bobvaluesi
differently
warmer
arr2length
recieve
95ms
135ms
150ms
35ms
debounce
debounced
600
deposits
banknotes
rejected
handed
prioritizes
banknotescount
atm
banknote
withdrawing
200
300
homogenous
no-adjacent-flowers
flowerbed
cbtinserter
cbtinsertertreenode
getroot
inserter
52372
numsliri
factoryj
factories
repairs
positionj
roboti
abcdefg
baggage
beefed
puzzlesi
faced
cabbage
obj2
obj1
excellent
uniqueid
employeeuni
numpeople
gift
112
3001
deci-binary
012201
1921681312
0011255245
patterni
wildcard
2-1
floored
floornumsi
exchanges
expressible
numsindex2
numsindexk
numsindex1
indexk
col1row1col2row2
rth
colrow
ratingk
ratingj
soldier
complementary
loops
endlessly
reportsto
anyone
smooth
descent
exempted
encodes
connectivity
alex
distinctly
second-largest
122
third-largest
aabc
well-formatted
3aab
-1a14
alternates
evalints
-2aaa
asterisk
4a
-6
5c
3bb
breaking
evalvars
islefti
descriptions
childi
descriptionsi
handi
straights
groupsize
jumbo
cheeseslices
totaljumbo
burgers
tomato
totalsmall
burger
tomatoslices
extraneous
ambiguous
205
000
formation
peoples
birthi
deathi
alive
revisit
3951
cycled
0158
3456
6345
ccatmmouse
catjump
mousejump
todelete
solitaire
countintervals
blacklist
blacklisted
solutiondouble
randpoint
shiftc
shiftsi-1
shiftx
p123m
iquerieslength-1
operationsi
baseball
14312
1412
meal
deliciousnessi
meals
deliciousness
sandwichesi
sandwich
sandwiches
cafeteria
lunch
univalue
builddictstring
magicdictionary
subfolder
underlying
bz
onetwothree
bxy
bw
subfolders
axy
bx
az
ax
repetitively
18291174312
21347112918
truncating
resrc
resr1c2height-r-1
2height1
res0n-12
resr1c-2height-r-1
survey
compatibility
achieved
student-mentor
mentorsj
mentors
studentsi
mentor
rw
acefg
re2
comma-delimited
abefh
understood
acadbcbd
re1
rabc
abdfg
rexpr
acdfh
concatenations
acdfg
abefg
brace
abdfh
rabcdefgh
ek
singleton
rabcd
rabbc
ra
acefh
dividers
corridor
divider
decorative
ocurrences
costs1
costs2
